Indexing & Selection

In [1]:
import pandas as pd

Add dataset

In [13]:
data = pd.read_csv("DataSets/Employee.csv")
data

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34.0,Male,No,0,0
1,Bachelors,2013,Pune,1,28.0,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38.0,Female,No,2,0
3,Masters,2016,Bangalore,3,27.0,Male,No,5,1
4,Masters,2017,Pune,3,24.0,Male,Yes,2,1
...,...,...,...,...,...,...,...,...,...
4648,Bachelors,2013,Bangalore,3,26.0,Female,No,4,0
4649,Masters,2013,Pune,2,37.0,Male,No,2,1
4650,Masters,2018,New Delhi,3,27.0,Male,No,5,1
4651,Bachelors,2012,Bangalore,3,30.0,Male,Yes,2,0
4652,Bachelors,2015,Bangalore,3,33.0,Male,Yes,4,0

In [37]:
data["Age"] #series
mean_age = data["Age"].mean()
max_age = data["Age"].max()

In [38]:
data_g = data[["Age","Gender","City"]] #dataFram

In [25]:
data.loc[0,"Age"]
data.iloc[3:9]
data.loc[5:15,["Age","City","JoiningYear"]]

     Age       City  JoiningYear
5   22.0  Bangalore         2016
6   38.0  New Delhi         2015
7   34.0  Bangalore         2016
8   23.0       Pune         2016
9   37.0  New Delhi         2017
10  27.0  Bangalore         2012
11  34.0       Pune         2016
12  32.0       Pune         2018
13  39.0  Bangalore         2016
14  37.0  Bangalore         2012
15  29.0  Bangalore         2017

In [54]:
data_con = data[data["Age"] > 30]
city_con = data[(data["City"] == "Bangalore") & (data["Age"] > 30) & (data["PaymentTier"] >= 2)]
print(city_con.shape)

(678, 9)